import React from 'react'
import WebanicOpt from './../WebanicOpt/WebanicOpt'
import Sponcers from './../Sponcers/Sponcers'
import FeatureOpt from './../FeatureOpt/FeatureOpt'

import {FiTarget} from 'react-icons/fi'
import {MdOutlineDesignServices} from 'react-icons/md'
import {FaUserCheck} from 'react-icons/fa'
import {IoMdConstruct} from 'react-icons/io'
import './About.css'

export default function About() {
  return (
    <div id='About'>
        <div id="about-webanic">
          <div id="webanic-text">
            <h2>شرکت دیجیتال وبانیک</h2>
            <p>شرکت دیجیتال مارکتینگ نوآد به عنوان شرکتی پیشرو در صنعت دیجیتال مارکتینگ ایران در تلاش است تا با بهره گیری از دانش فنی روز و ارایه راهکارهای نوین بازاریابی و برندینگ، با پیشرفت کسب و کارهای داخلی نقش مهمی در شکوفایی اقتصادی ایران ایفا نماید و با تثبیت نام نوآد به عنوان تخصصی ترین برند دیجیتال مارکتینگ در ایران و گسترش نام آن در بازارهای جهانی به صادرات خدمات مبتنی بر تکنولوژی های نوین گام بردارد. نوآد پیشرفت خود در طول یک دهه فعالیت را مرهون شفافیت، انسجام و پایبندی به نتایج پیش بینی شده مشتریان خود می داند. سرمایه گذاری روی تکنولوژی های نوین، کیفیت و نوآوری، پایبندی به تعهدات، رضایتمندی و وفاداری مشتریان، نیروی انسانی متمرکز و پویا از ارزش های ذاتی نوآد می باشند. فضای دیجیتال تحول شگرف در ارتباطات و نحوه تعامل مردم با یکدیگر بوجود آورده است. ابزارها و پلتفرم های بوجود آمده در این عصر، قدرت چانه زنی و انتخاب را برای مردم افزایش داده و موجب سهولت در ارزیابی و مقایسه برندها و محصولات مختلف گردیده است. ما این تغییر نگرش در انتخاب یک برند و محصول را نوعی فرصت برای خود و مشتریانمان به حساب می آوریم. در فضای دیجیتال به راحتی می توان بازار هدف را شناسایی، نیازها، خواسته ها و علایق آنها را کشف و با استفاده از اطلاعاتی که بدست می آید به خلق و توسعه محصولات، برند و تجربیات مناسب که از ادغام تکنولوژی و خلاقیت در کنار متد بازاریابی نوین ناشی میشود، اقدام کرد. در نوآد ما آماده پذیرفتن چالش های جدید هستیم و با هر قیمت که شده به تعهدات خود پایبند می مانیم.</p>
            <WebanicOpt text="دارای بیش از 10 سال تجربه در زمینه طرااحی ئ لندینگ سایت های استاتیک و داینامیک"/>
            <WebanicOpt text="دارای کادری مجرب و دوره دیده با مدرک های قابل قبول  بازار کار"/>
            <WebanicOpt text=" دارای پشتیبانی 24/7 و ضمانت کالا و همینطور خدمات پس از فروش تا 6 ماه پس از فروش"/>
            <p>خدمات نوآد در جهت یکپارچه سازی تمامی فعالیت های یک کسب و کار از مرحله ورود به بازار، ساخت، گسترش و ایجاد تصویری یکپاچه از برند، دیجیتال مارکتینگ، افزایش مزیت رقابتی و سهم بازار تا مراحل پس از فروش و ایجاد وفاداری در مشتریان یک برند ارایه می گردد.</p>
          </div>
          <img id="webanic-pic" src='./about.jpg' />
        </div>
        <div id="sponcers-par">
            <Sponcers></Sponcers>
            <Sponcers></Sponcers>
            <Sponcers></Sponcers>
            <Sponcers></Sponcers>
            <Sponcers></Sponcers>
            <Sponcers></Sponcers>
            <Sponcers></Sponcers>
            <Sponcers></Sponcers>
            <Sponcers></Sponcers>
        </div>
        <div id="features-par">
          <div src="./features.jpg" alt=""  id='features-pic'/>
        
          <div id="features">
            <FeatureOpt text="در این بخش، اهمیت مفهوم و هدف اصلی وب‌سایت شما بیان می‌شود. آیا وب‌سایت شما برای ارتباط با مخاطبین، فروش محصولات، ارائه اطلاعات، یا هدف دیگری طراحی شده است" title="مفهوم و هدف وب‌سایت">
              <FiTarget/>
            </FeatureOpt>
            <FeatureOpt text="در این بخش، به اهمیت تجربه کاربری در وب‌سایت اشاره می‌شود. چگونه از نظر طراحی و ارائه محتوا تا تعامل با کاربران، وب‌سایت شما باید تجربه بهینه کاربری را ارائه دهد." title="تجربه کاربری (UX)">
              <FaUserCheck/>
            </FeatureOpt>
            <FeatureOpt text="این بخش به جزئیات طراحی وب‌سایت اختصاص دارد. چگونگی انتخاب رنگ‌ها، فونت‌ها، تنظیمات تایپوگرافی، تصاویر، و طراحی رابط کاربری (UI) برای جلب توجه کاربران مطرح می‌شود." title="طراحی و ظاهر وب‌سایت">
            <MdOutlineDesignServices/>
            </FeatureOpt>
            <FeatureOpt text="در این بخش، به ساختار وب‌سایت و نحوه گروه‌بندی صفحات و محتواها پرداخته می‌شود. از جمله، چگونگی سازماندهی منوها، صفحات داخلی، و ناوبری وب‌سایت برای بهترین دسترسی به اطلاعات و خدمات ارائه شده." title="ساختار و معماری وب‌سایت">
            <IoMdConstruct/>
            </FeatureOpt>
          </div>
          </div>

    </div>
  )
}
